openfoam/turek_cylinderA_dynamic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          51;
        startFace       39898;
    }
    outlet
    {
        type            patch;
        nFaces          51;
        startFace       39949;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          220;
        startFace       40000;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          220;
        startFace       40220;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12608;
        startFace       40440;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12536;
        startFace       53048;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          848;
        startFace       65584;
    }
    beam
    {
        type            wall;
        inGroups        1(wall);
        nFaces          968;
        startFace       66432;
    }
)

// ************************************************************************* //
