openfoam/turek_cylinderA_dynamic/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs
(
    fvMotionSolvers
);

motionSolver displacementLaplacian;

diffusivity uniform;